# StairClosedBoundariesError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairClosedBoundariesError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairClosedBoundariesError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairClosedBoundariesError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairClosedBoundariesError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace